zuzya3010/hoverboard-AT32F413RCT7/Drivers/AT32F4xx_StdPeriph_Driver/inc/at32f403_tim.h
#define TMR_OutputState_Disable            ((uint16_t)0x0000)
#define TMR_OutputState_Enable             ((uint16_t)0x0001)
#define IS_TMR_OUTPUT_STATE(STATE)         (((STATE) == TMR_OutputState_Disable) || \
                                            ((STATE) == TMR_OutputState_Enable))
/**
  * @}
  */ 

/** @defgroup TMR_Output_Compare_N_state 
  * @{
  */

#define TMR_OutputNState_Disable           ((uint16_t)0x0000)
#define TMR_OutputNState_Enable            ((uint16_t)0x0004)
#define IS_TMR_OUTPUTN_STATE(STATE)        (((STATE) == TMR_OutputNState_Disable) || \
                                            ((STATE) == TMR_OutputNState_Enable))
/**
  * @}
  */ 

/** @defgroup TMR_Capture_Compare_state 
  * @{
  */

#define TMR_CCx_Enable                     ((uint16_t)0x0001)
#define TMR_CCx_Disable                    ((uint16_t)0x0000)
#define IS_TMR_CCX(CCX)                    (((CCX) == TMR_CCx_Enable) || \
                                            ((CCX) == TMR_CCx_Disable))
/**
  * @}
  */ 

/** @defgroup TMR_Capture_Compare_N_state 
  * @{
  */

#define TMR_CCxN_Enable                    ((uint16_t)0x0004)
#define TMR_CCxN_Disable                   ((uint16_t)0x0000)
#define IS_TMR_CCXN(CCXN)                  (((CCXN) == TMR_CCxN_Enable) || \
                                            ((CCXN) == TMR_CCxN_Disable))
/**
  * @}
  */ 

/** @defgroup Break_Input_enable_disable 
  * @{
  */

#define TMR_Break_Enable                  ((uint16_t)0x1000)
#define TMR_Break_Disable                 ((uint16_t)0x0000)
#define IS_TMR_BREAK_STATE(STATE)         (((STATE) == TMR_Break_Enable) || \
                                           ((STATE) == TMR_Break_Disable))
/**
  * @}
  */ 

/** @defgroup Break_Polarity 
  * @{
  */

#define TMR_BreakPolarity_Low             ((uint16_t)0x0000)
#define TMR_BreakPolarity_High            ((uint16_t)0x2000)
#define IS_TMR_BREAK_POLARITY(POLARITY)   (((POLARITY) == TMR_BreakPolarity_Low) || \
                                           ((POLARITY) == TMR_BreakPolarity_High))
/**
  * @}
  */ 

/** @defgroup TMR_AOE_Bit_Set_Reset 
  * @{
  */

#define TMR_AutomaticOutput_Enable            ((uint16_t)0x4000)
#define TMR_AutomaticOutput_Disable           ((uint16_t)0x0000)
#define IS_TMR_AUTOMATIC_OUTPUT_STATE(STATE)  (((STATE) == TMR_AutomaticOutput_Enable) || \
                                               ((STATE) == TMR_AutomaticOutput_Disable))
/**
  * @}
  */ 

/** @defgroup Lock_level 
  * @{
  */

#define TMR_LOCKgrade_OFF                  ((uint16_t)0x0000)
#define TMR_LOCKgrade_1                    ((uint16_t)0x0100)
#define TMR_LOCKgrade_2                    ((uint16_t)0x0200)
#define TMR_LOCKgrade_3                    ((uint16_t)0x0300)
#define IS_TMR_LOCK_grade(grade)           (((grade) == TMR_LOCKgrade_OFF) || \
                                            ((grade) == TMR_LOCKgrade_1) || \
                                            ((grade) == TMR_LOCKgrade_2) || \
                                            ((grade) == TMR_LOCKgrade_3))
/**
  * @}
  */ 

/** @defgroup OSSI_Off_State_Selection_for_Idle_mode_state 
  * @{
  */

#define TMR_OSIMIState_Enable              ((uint16_t)0x0400)
#define TMR_OSIMIState_Disable             ((uint16_t)0x0000)
#define IS_TMR_OSIMI_STATE(STATE)          (((STATE) == TMR_OSIMIState_Enable) || \
                                            ((STATE) == TMR_OSIMIState_Disable))
/**
  * @}
  */

/** @defgroup OSSR_Off_State_Selection_for_Run_mode_state 
  * @{
  */

#define TMR_OSIMRState_Enable              ((uint16_t)0x0800)
#define TMR_OSIMRState_Disable             ((uint16_t)0x0000)
#define IS_TMR_OSIMR_STATE(STATE)          (((STATE) == TMR_OSIMRState_Enable) || \
                                            ((STATE) == TMR_OSIMRState_Disable))
/**
  * @}
  */ 

/** @defgroup TMR_Output_Compare_Idle_State 
  * @{
  */

#define TMR_OCIdleState_Set                ((uint16_t)0x0100)
#define TMR_OCIdleState_Reset              ((uint16_t)0x0000)
#define IS_TMR_OCIDLE_STATE(STATE)         (((STATE) == TMR_OCIdleState_Set) || \
                                            ((STATE) == TMR_OCIdleState_Reset))
/**
  * @}
  */ 

/** @defgroup TMR_Output_Compare_N_Idle_State 
  * @{
  */

#define TMR_OCNIdleState_Set               ((uint16_t)0x0200)
#define TMR_OCNIdleState_Reset             ((uint16_t)0x0000)
#define IS_TMR_OCNIDLE_STATE(STATE)        (((STATE) == TMR_OCNIdleState_Set) || \
                                            ((STATE) == TMR_OCNIdleState_Reset))
/**
  * @}
  */ 

/** @defgroup TMR_Input_Capture_Polarity 
  * @{
  */

#define  TMR_ICPolarity_Rising             ((uint16_t)0x0000)
#define  TMR_ICPolarity_Falling            ((uint16_t)0x0002)
#define  TMR_ICPolarity_BothEdge           ((uint16_t)0x000A)
#define IS_TMR_IC_POLARITY(POLARITY)       (((POLARITY) == TMR_ICPolarity_Rising) || \
                                            ((POLARITY) == TMR_ICPolarity_Falling))
#define IS_TMR_IC_POLARITY_LITE(POLARITY)  (((POLARITY) == TMR_ICPolarity_Rising) || \
                                            ((POLARITY) == TMR_ICPolarity_Falling)|| \
                                            ((POLARITY) == TMR_ICPolarity_BothEdge))                                      
/**
  * @}
  */ 

/** @defgroup TMR_Input_Capture_Selection 
  * @{
  */

#define TMR_ICSelection_DirectTI           ((uint16_t)0x0001) /*!< TMR Input 1, 2, 3 or 4 is selected to be 
                                                                   connected to IC1, IC2, IC3 or IC4, respectively */
#define TMR_ICSelection_IndirectTI         ((uint16_t)0x0002) /*!< TMR Input 1, 2, 3 or 4 is selected to be
                                                                   connected to IC2, IC1, IC4 or IC3, respectively. */
#define TMR_ICSelection_TRC                ((uint16_t)0x0003) /*!< TMR Input 1, 2, 3 or 4 is selected to be connected to TRC. */
#define IS_TMR_IC_SELECTION(SELECTION)     (((SELECTION) == TMR_ICSelection_DirectTI) || \
                                            ((SELECTION) == TMR_ICSelection_IndirectTI) || \
                                            ((SELECTION) == TMR_ICSelection_TRC))
/**
  * @}
  */ 

/** @defgroup TMR_Input_Capture_Prescaler 
  * @{
  */

#define TMR_ICDIV_DIV1                     ((uint16_t)0x0000) /*!< Capture performed each time an edge is detected on the capture input. */
#define TMR_ICDIV_DIV2                     ((uint16_t)0x0004) /*!< Capture performed once every 2 events. */
#define TMR_ICDIV_DIV4                     ((uint16_t)0x0008) /*!< Capture performed once every 4 events. */
#define TMR_ICDIV_DIV8                     ((uint16_t)0x000C) /*!< Capture performed once every 8 events. */
#define IS_TMR_IC_DIV(DIV)                 (((DIV) == TMR_ICDIV_DIV1) || \
                                            ((DIV) == TMR_ICDIV_DIV2) || \
                                            ((DIV) == TMR_ICDIV_DIV4) || \
                                            ((DIV) == TMR_ICDIV_DIV8))
/**
  * @}
  */ 

/** @defgroup TMR_interrupt_sources 
  * @{
  */

#define TMR_INT_Overflow                    ((uint16_t)0x0001)
#define TMR_INT_CC1                         ((uint16_t)0x0002)
#define TMR_INT_CC2                         ((uint16_t)0x0004)
#define TMR_INT_CC3                         ((uint16_t)0x0008)
#define TMR_INT_CC4                         ((uint16_t)0x0010)
#define TMR_INT_HALL                        ((uint16_t)0x0020)
#define TMR_INT_Trigger                     ((uint16_t)0x0040)
#define TMR_INT_Break                       ((uint16_t)0x0080)
#define IS_TMR_INT(INT) ((((INT) & (uint16_t)0xFF00) == 0x0000) && ((INT) != 0x0000))

#define IS_TMR_GET_INT(INT)                 (((INT) == TMR_INT_Overflow) || \
                                             ((INT) == TMR_INT_CC1) || \
                                             ((INT) == TMR_INT_CC2) || \
                                             ((INT) == TMR_INT_CC3) || \
                                             ((INT) == TMR_INT_CC4) || \
                                             ((INT) == TMR_INT_HALL) || \
                                             ((INT) == TMR_INT_Trigger) || \
                                             ((INT) == TMR_INT_Break))
/**
  * @}
  */ 

/** @defgroup TMR_DMA_Base_address 
  * @{
  */

#define TMR_DMABase_CTRL1                   ((uint16_t)0x0000)
#define TMR_DMABase_CTRL2                   ((uint16_t)0x0001)
#define TMR_DMABase_SMC                     ((uint16_t)0x0002)
#define TMR_DMABase_DIE                     ((uint16_t)0x0003)
#define TMR_DMABase_STS                     ((uint16_t)0x0004)
#define TMR_DMABase_EVEG                    ((uint16_t)0x0005)
#define TMR_DMABase_CCM1                    ((uint16_t)0x0006)
#define TMR_DMABase_CCM2                    ((uint16_t)0x0007)
#define TMR_DMABase_CCE                     ((uint16_t)0x0008)
#define TMR_DMABase_CNT                     ((uint16_t)0x0009)
#define TMR_DMABase_DIV                     ((uint16_t)0x000A)
#define TMR_DMABase_AR                      ((uint16_t)0x000B)
#define TMR_DMABase_RC                      ((uint16_t)0x000C)
#define TMR_DMABase_CC1                     ((uint16_t)0x000D)
#define TMR_DMABase_CC2                     ((uint16_t)0x000E)
#define TMR_DMABase_CC3                     ((uint16_t)0x000F)
#define TMR_DMABase_CC4                     ((uint16_t)0x0010)
#define TMR_DMABase_BRKDT                   ((uint16_t)0x0011)
#define TMR_DMABase_DMAC                    ((uint16_t)0x0012)
#define IS_TMR_DMA_BASE(BASE)               (((BASE) == TMR_DMABase_CTRL1) || \
                                             ((BASE) == TMR_DMABase_CTRL2) || \
                                             ((BASE) == TMR_DMABase_SMC) || \
                                             ((BASE) == TMR_DMABase_DIE) || \
                                             ((BASE) == TMR_DMABase_STS) || \
                                             ((BASE) == TMR_DMABase_EVEG) || \
                                             ((BASE) == TMR_DMABase_CCM1) || \
                                             ((BASE) == TMR_DMABase_CCM2) || \
                                             ((BASE) == TMR_DMABase_CCE) || \
                                             ((BASE) == TMR_DMABase_CNT) || \
                                             ((BASE) == TMR_DMABase_DIV) || \
                                             ((BASE) == TMR_DMABase_AR) || \
                                             ((BASE) == TMR_DMABase_RC) || \
                                             ((BASE) == TMR_DMABase_CC1) || \
                                             ((BASE) == TMR_DMABase_CC2) || \
                                             ((BASE) == TMR_DMABase_CC3) || \
                                             ((BASE) == TMR_DMABase_CC4) || \
                                             ((BASE) == TMR_DMABase_BRKDT) || \
                                             ((BASE) == TMR_DMABase_DMAC))
/**
  * @}
  */ 

/** @defgroup TMR_DMA_Burst_Length 
  * @{
  */

#define TMR_DMABurstLength_1Transfer           ((uint16_t)0x0000)
#define TMR_DMABurstLength_2Transfers          ((uint16_t)0x0100)
#define TMR_DMABurstLength_3Transfers          ((uint16_t)0x0200)
#define TMR_DMABurstLength_4Transfers          ((uint16_t)0x0300)
#define TMR_DMABurstLength_5Transfers          ((uint16_t)0x0400)
#define TMR_DMABurstLength_6Transfers          ((uint16_t)0x0500)
#define TMR_DMABurstLength_7Transfers          ((uint16_t)0x0600)
#define TMR_DMABurstLength_8Transfers          ((uint16_t)0x0700)
#define TMR_DMABurstLength_9Transfers          ((uint16_t)0x0800)
#define TMR_DMABurstLength_10Transfers         ((uint16_t)0x0900)
#define TMR_DMABurstLength_11Transfers         ((uint16_t)0x0A00)
#define TMR_DMABurstLength_12Transfers         ((uint16_t)0x0B00)
#define TMR_DMABurstLength_13Transfers         ((uint16_t)0x0C00)
#define TMR_DMABurstLength_14Transfers         ((uint16_t)0x0D00)
#define TMR_DMABurstLength_15Transfers         ((uint16_t)0x0E00)
#define TMR_DMABurstLength_16Transfers         ((uint16_t)0x0F00)
#define TMR_DMABurstLength_17Transfers         ((uint16_t)0x1000)
#define TMR_DMABurstLength_18Transfers         ((uint16_t)0x1100)
#define IS_TMR_DMA_LENGTH(LENGTH)              (((LENGTH) == TMR_DMABurstLength_1Transfer) || \
                                                ((LENGTH) == TMR_DMABurstLength_2Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_3Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_4Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_5Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_6Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_7Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_8Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_9Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_10Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_11Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_12Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_13Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_14Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_15Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_16Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_17Transfers) || \
                                                ((LENGTH) == TMR_DMABurstLength_18Transfers))
/**
  * @}
  */ 

